import clsx from 'clsx';

// Сообщаем вебпаку, что этот файл использует это изображение.
import plane from 'src/images/plane.png';
import { Text } from 'src/ui/text';

import styles from './Article.module.scss';

export const Article = () => {
	return (
		<article className={clsx(styles.article)}>
			<Text as='h1' size={45} weight={800} uppercase dynamicLite>
				Портрет ИИ-котика
			</Text>
			<div className={styles.titleDescription}>
				<Text size={22} weight={800} uppercase align='center' dynamicLite>
					Рисует высокотехнологичный художник Алиса 
				</Text>
			</div>
			<img className={styles.image} src={plane} alt='Картинка самолета' />
			<Text dynamic size={18} fontStyle='italic'>
				Изображение: АлисаGPT ©
				2025 
			</Text>
			<Text dynamic size={18}>
			Белый котик, нарисованный искусственным интеллектом, смотрит на вас своими большими глазами, 
			словно приглашая в мир фантазий. Его пушистая шерсть искрится в лучах виртуального солнца, 
			а мягкая улыбка обещает бесконечные приключения. Этот котик — творение современных технологий, 
			но его сердце полно тепла и доброты.
			</Text>
			<Text dynamic size={18}>
			Идея создания искусственного интеллекта возникла еще в древности. 
			Например, в Древнем Египте была сделана механическая статуя бога Амона, 
			которая могла «оживать». В средние века испанский философ и математик Раймонд 
			Луллий стремился создать механизм для решения различных задач. В XVIII веке философы Декарт 
			и Лейбниц развили эту идею, создав унифицированный язык для классификации наук. Однако как 
			научное направление искусственный интеллект сформировался после появления электронных вычислительных 
			машин в 1940-х годах и выхода основных положений кибернетики, основанной Норбертом Винером. 
			В 1956 году на семинаре в Дартмутском колледже было сформулировано название и создана отдельная 
			дисциплина «искусственный интеллект».
			</Text>
			<Text dynamic size={18}>
			Первые годы изучения искусственного интеллекта были полны энтузиазма. Алан Тьюринг в 1950 году 
			предложил тест для проверки интеллектуального уровня машин. В 1956 году была разработана первая 
			программа на основе символов — «Логик-Теоретик», способная автоматически доказывать теоремы. В 1958 
			году появился язык программирования Lisp, ставший основным инструментом в этой области. В конце 1950-х 
			начались разработки нейронных сетей, а в 1963 году был создан «принцип резолюции» для автоматического 
			доказательства теорем, который лег в основу языка Prolog.
			</Text>
		</article>
	);
};
